Repository: FelixSchwarz/pycerberus
Catalog: pycerberus/locales/*/LC_MESSAGES/pycerberus.po
Languages: de

source: Value must not be empty.
de: Bitte geben Sie einen Wert ein.

source: if "allow_additional_parameters" is False, "filter_unvalidated_parameters=False" is meaningless
de: Wenn "allow_additional_parameters" False ist, wird die Angabe von "filter_unvalidated_parameters=False" ignoriert

source: Validator got unexpected input (expected "dict", got "%(classname)s").
de: Unerwartete Eingabe für Validator ("dict" erwartet, "%(classname)s" erhalten).

source: Undeclared field detected: "%(additional_item)s".
de: Nicht deklariertes Feld gefunden: "%(additional_item)s".

source: Unknown parameter "%(additional_item)s"
de: Unbekannter Parameter "%(additional_item)s"

source: Validator got unexpected input (expected string, got "%(classname)s").
de: Unerwartete Eingabe für Validator (String erwartet, "%(classname)s" erhalten).

source: Please enter a number.
de: Bitte geben Sie eine Zahl ein.

source: Number must be %(min)d or greater.
de: Die Zahl muss größer oder gleich %(min)d sein.

source: Number must be %(max)d or smaller.
de: Die Zahl muss kleiner oder gleich %(max)d sein.

source: Value should be "%s" or "%s".
de: Der Wert sollte "%s" oder "%s" sein.

source: Please accept our Terms and Conditions.
de: Bitte akzeptieren Sie unsere AGB.

source: Invalid character "%(invalid_character)s" in domain "%(domain)s".
de: Ungültiges Zeichen "%(invalid_character)s" in der Domain "%(domain)s".

source: Invalid domain: "%(domain)s" must not start with a dot.
de: Ungültige Domain: "%(domain)s" darf nicht mit einem Punkt beginnen.

source: Invalid domain: "%(domain)s" must not end with a dot.
de: Ungültige Domain: "%(domain)s" darf nicht mit einem Punkt enden.

source: Invalid domain: "%(domain)s" must not contain consecutive dots.
de: Ungültige Domain: "%(domain)s" darf keine aufeinanderfolgenden Punkte enthalten.

source: An email address must contain a single '@'.
de: Eine E-Mail-Adresse darf nur ein einziges '@'-Zeichen enthalten.

source: Invalid character "%(invalid_character)s" in email address "%(emailaddress)s".
de: Ungültiges Zeichen "%(invalid_character)s" in der E-Mail-Adresse "%(emailaddress)s".

source: Missing domain in email address "%(emailaddress)s".
de: Fehlende Domain in E-Mail-Adresse "%(emailaddress)s".

source: More than %(min)d items required.
de: Es werden mehr als %(min)d Einträge benötigt.

source: Less than %(max)d items required.
de: Es werden weniger als %(max)d Einträge benötigt.

source: Fields do not match
de: Die Felder stimmen nicht überein.

source: This value is not allowed.
de: Dieser Wert ist nicht erlaubt.

source: Input "%(input_)s" does not match the expected pattern.
de: Die Eingabe "%(input_)s" entspricht nicht dem erwarteten Muster.

source: Must be less than %(max)d characters long.
de: Bitte geben Sie weniger als %(max)d Zeichen ein.

source: Must be at least %(min)d characters long.
de: Bitte geben Sie mindestens %(min)d Zeichen ein.
